## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.clamav_update_avdefs will be created
  + resource "aws_cloudwatch_event_rule" "clamav_update_avdefs" {
      + arn                 = (known after apply)
      + description         = "Updates ClamAV virus database every 2 hours"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = false
      + name                = "clamav-update-avdefs-production"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(2 hours)"
      + tags                = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.trigger_api_lambda_to_download_clamav_defs will be created
  + resource "aws_cloudwatch_event_target" "trigger_api_lambda_to_download_clamav_defs" {
      + arn            = "arn:aws:lambda:ca-central-1:806545929748:function:api"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + task = "clamav_update_virus_defs"
            }
        )
      + rule           = "clamav-update-avdefs-production"
      + target_id      = "scan-files-production-clamav-update-avdefs"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
